#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.ssh-key.random_pet.ssh_key_name: Refreshing state... [id=sshinporpoise]
data.azurerm_client_config.current: Reading...
module.resource-group.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1kMGExZjUyYi1mNGVhLTQzMTItOTEzYS1hMDg3YWNiZDI1YzE7b2JqZWN0SWQ9NDU3Y2ViYTMtOTYzYy00YjY5LThkYWQtMmFkMzU1MjE2MDkzO3N1YnNjcmlwdGlvbklkPTc3MzQ4ZTZjLTAyODYtNDk2Zi04MzM2LTI4ZTk2NmIxMzY0ODt0ZW5hbnRJZD1lNjBiYjc2Yy04ZmRhLTRlZDQtYTM1NC00ODM2ZTNiZmNiYzM=]
module.am-dce.azurerm_monitor_data_collection_endpoint.dce: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Insights/dataCollectionEndpoints/MSProm-australiaeast-prod-velidaaks]
module.azure-monitor-workspace.azurerm_monitor_workspace.workspace: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/prod-amw-velidaaks]
module.user_assigned_identity.azurerm_user_assigned_identity.msi: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ManagedIdentity/userAssignedIdentities/prod-uai-velidaaks]
module.ssh-key.azapi_resource.ssh_public_key: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshinporpoise]
module.managed-grafana.azurerm_dashboard_grafana.grafana: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/prod-grafana-velidaaks]
module.am-dcr.azurerm_monitor_data_collection_rule.dcr: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Insights/dataCollectionRules/MSProm-australiaeast-prod-velidaaks]
module.network_contributor_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Authorization/roleAssignments/d5c0ab69-4d83-1549-9384-44f8fa8590c8]
module.acr.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/prodacrvelidaaks]
module.ssh-key.azapi_resource_action.ssh_public_key_gen: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshinporpoise/generateKeyPair]
module.aks.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/prod-velidaaks]
module.monitoring_data_reader_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/prod-amw-velidaaks/providers/Microsoft.Authorization/roleAssignments/fd0fc2a8-96d9-ad3d-5096-4ae23dfaa5a0]
module.acr_pull_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/prodacrvelidaaks/providers/Microsoft.Authorization/roleAssignments/6f5e1c47-db94-a687-18e1-8ded834d36c5]
azurerm_resource_policy_assignment.linuxbaseline: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/prod-velidaaks/providers/Microsoft.Authorization/policyAssignments/enforce-aks-pod-baseline-linux]
module.am-dcr.azurerm_monitor_data_collection_rule_association.dcra: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/prod-velidaaks/providers/Microsoft.Insights/dataCollectionRuleAssociations/dcra-dcr-prometheus-aks]
module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.node_recording_rules_rule_group: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.AlertsManagement/prometheusRuleGroups/NodeRecordingRulesRuleGroup-prod-velidaaks]
module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.kubernetes_recording_rules_rule_group: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.AlertsManagement/prometheusRuleGroups/KubernetesRecordingRulesRuleGroup-prod-velidaaks]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.acr.azurerm_container_registry.acr will be updated in-place
  ~ resource "azurerm_container_registry" "acr" {
        id                            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/prodacrvelidaaks"
        name                          = "prodacrvelidaaks"
      ~ tags                          = {
            "application" = "velidaaks"
            "environment" = "prod"
            "location"    = "australiaeast"
            "owner"       = "willvelida"
            "sub"         = "MVP-sub"
          + "type"        = "POC"
        }
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.aks.azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/prod-velidaaks"
        name                                = "prod-velidaaks"
      ~ tags                                = {
            "application" = "velidaaks"
            "environment" = "prod"
            "location"    = "australiaeast"
            "owner"       = "willvelida"
            "sub"         = "MVP-sub"
          + "type"        = "POC"
        }
        # (40 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {}
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (7 unchanged blocks hidden)
    }

  # module.azure-monitor-workspace.azurerm_monitor_workspace.workspace will be updated in-place
  ~ resource "azurerm_monitor_workspace" "workspace" {
        id                                  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/prod-amw-velidaaks"
        name                                = "prod-amw-velidaaks"
      ~ tags                                = {
            "application" = "velidaaks"
            "environment" = "prod"
            "location"    = "australiaeast"
            "owner"       = "willvelida"
            "sub"         = "MVP-sub"
          + "type"        = "POC"
        }
        # (6 unchanged attributes hidden)
    }

  # module.dapr-extension.azurerm_kubernetes_cluster_extension.ext will be created
  + resource "azurerm_kubernetes_cluster_extension" "ext" {
      + aks_assigned_identity = (known after apply)
      + cluster_id            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/prod-velidaaks"
      + current_version       = (known after apply)
      + extension_type        = "Microsoft.Dapr"
      + id                    = (known after apply)
      + name                  = "dapr"
      + release_namespace     = (known after apply)
      + release_train         = "Stable"
      + target_namespace      = (known after apply)
    }

  # module.grafana_admin_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5667d54a-8d63-4fab-87b9-1df5e5804189"
      + principal_type                   = "User"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/prod-grafana-velidaaks"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.managed-grafana.azurerm_dashboard_grafana.grafana will be updated in-place
  ~ resource "azurerm_dashboard_grafana" "grafana" {
        id                                     = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/prod-grafana-velidaaks"
        name                                   = "prod-grafana-velidaaks"
      ~ tags                                   = {
            "application" = "velidaaks"
            "environment" = "prod"
            "location"    = "australiaeast"
            "owner"       = "willvelida"
            "sub"         = "MVP-sub"
          + "type"        = "POC"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.resource-group.azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks"
        name       = "rg-velidaaks"
      ~ tags       = {
            "application" = "velidaaks"
            "environment" = "prod"
            "location"    = "australiaeast"
            "owner"       = "willvelida"
            "sub"         = "MVP-sub"
          + "type"        = "POC"
        }
        # (2 unchanged attributes hidden)
    }

  # module.user_assigned_identity.azurerm_user_assigned_identity.msi will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "msi" {
        id                  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ManagedIdentity/userAssignedIdentities/prod-uai-velidaaks"
        name                = "prod-uai-velidaaks"
      ~ tags                = {
            "application" = "velidaaks"
            "environment" = "prod"
            "location"    = "australiaeast"
            "owner"       = "willvelida"
            "sub"         = "MVP-sub"
          + "type"        = "POC"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 6 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @willvelida, Action: `pull_request`*